In [1]:
#data cleaning 
#veri tutarsizliginin saptanmasi
#eksik veirlerin giderilmesi
#aykiri degerlerin giderilmesi

In [2]:
#tekrar eden degerleir silme
#harilamata(mapping)
#eksik yere deger atama
#satir ve sutun isimlerini degistirme

In [66]:
import pandas as pd ; import numpy as np

In [67]:
#dataframe olusturalim 
veri = pd.DataFrame({"a":["bir","iki"]*3, "b":[1,1,2,3,2,3]})
veri

     a  b
0  bir  1
1  iki  1
2  bir  2
3  iki  3
4  bir  2
5  iki  3

In [68]:
#tekrar eden deger var mi ? 
veri.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [69]:
#terar eden saturlari kaldirmak (duplicate kaldirmak )
veri.drop_duplicates()

     a  b
0  bir  1
1  iki  1
2  bir  2
3  iki  3

In [70]:
#hepsini degil de istedigimiz araligi kontrol etmek icin 
#once yeni bir sutun ekleyelim 
veri["c"]=range(6)
veri

     a  b  c
0  bir  1  0
1  iki  1  1
2  bir  2  2
3  iki  3  3
4  bir  2  4
5  iki  3  5

In [71]:
#sadece a sutununu kontrol ediyoruz / hem a hem b 
veri.duplicated(["a","b"])

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [72]:
#mapping
vs = pd.DataFrame({"isim":["Ali", "can","Nur","Efe","ata"],
                   "puan":[60,50,70,80,40]})
vs

  isim  puan
0  Ali    60
1  can    50
2  Nur    70
3  Efe    80
4  ata    40

In [73]:
#yeni bir veri olusturuyoruz\
sinif = {"Ali":"A","Can":"A","Nur":"A","Efe":"B","Ata":"B"}

In [74]:
#sozcujlerin bas harflerini buyutelim once 
ad = vs["isim"].str.capitalize()

In [75]:
#mapping kullanarak sinifi dataframe e ekliyoruz 
#sube burda sutun adi. ad dedigimiz de bas harflerini degistirdiktwn sonraki dosya ismi
vs["sube"]=ad.map(sinif)
vs

  isim  puan sube
0  Ali    60    A
1  can    50    A
2  Nur    70    A
3  Efe    80    B
4  ata    40    B

In [76]:
#deger atama
nt = pd.Series([80,70,90,60])
nt

0    80
1    70
2    90
3    60
dtype: int64

In [77]:
#herhangi bir veriyi eksik veriye ceviriyoruz Bunu birden fazla da yapabiliriz 
#70i nan olarak, 60i sifir olarak degistirdik 
nt.replace([70,60],[np.nan,0])

0    80.0
1     NaN
2    90.0
3     0.0
dtype: float64

In [78]:
#aynisini sozluk oalrak yazarsak 
#90i 100 yapti, 60i sifir yapti
nt.replace({90:100,60:0})

0     80
1     70
2    100
3      0
dtype: int64

In [79]:
#satir ve sutun isimlendirme 
#kafadan bir dataframe olusturduk
df = pd.DataFrame(np.arange(12).reshape(3,4),
                  index = [0,1,2],
                  columns = ["ali","efe","eda","can"])
df

   ali  efe  eda  can
0    0    1    2    3
1    4    5    6    7
2    8    9   10   11

In [80]:
#once bir s Series olustrurduk , sonra onu df.index e mapping ile ekledik sorna da dfyi yeniden yazdirdik 

s=pd.Series(["bir","iki","uc"])
df.index=df.index.map(s)
df

     ali  efe  eda  can
bir    0    1    2    3
iki    4    5    6    7
uc     8    9   10   11

In [81]:
#basliklari buyuk harfe cevirmek icin str methodunu kullaniyoruz
df.rename(index=str.title,columns=str.upper)

     ALI  EFE  EDA  CAN
Bir    0    1    2    3
Iki    4    5    6    7
Uc     8    9   10   11

In [86]:
#rename methodu kullarak sarie ve sutun isimlerini degistirebiliriz 
#inplace ile yeni halini kaydettik 
df.rename(index = {"bir":"On","iki":2},columns={"can":"Utku","efe":"Ahmet"},inplace = True)

In [87]:
df

    ali  Ahmet  eda  Utku
On    0      1    2     3
2     4      5    6     7
uc    8      9   10    11